% x1=[0:0.01:5]
% y1=(3-x1)./3
% y2=3-3.*x1;
% y3=0.*x1;
% plot(x1,y1,x1,y2)
% text(3,3,['(',num2str(3),',',num2str(3),')'])
% text(0.75,0.75,['(',num2str(0.75),',',num2str(0.75),')'])
% text(0.25,1.25,['(',num2str(0.25),',',num2str(1.25),')'])
% text(0.15,0.95,['(',num2str(0.15),',',num2str(0.95),')'])
% text(0.1,0.1,['(',num2str(0.1),',',num2str(0.1),')'])
% % text(0.75,0.75,['(',num2str(0.75),',',num2str(0.75),')'])
% text(1.5,0.25,['(',num2str(1.5),',',num2str(0.25),')'])
% text(0.975,0.075,['(',num2str(0.975),',',num2str(0.075),')'])
% axis([0 3.5 0 3.5])



clc;
clear all;
close all;
x=[10,50,100,200,300,500,1000];
y1=[4.4255,4.2326,6.1670,15.491,22.728,20.8977,20.45];
y2=[0.7354,0.4962,0.2760,0.2364,0.2868,0.2448,0.1470];
[AX]=plotyy(x,y1,x,y2);
set(get(gca,'xlabel'),'string','惩罚因子');
set(get(AX(1),'Ylabel'),'string','时间（秒）');
set(get(AX(2),'Ylabel'),'string','精度');
set(gca,'xTick',[0:100:1000]);
set(AX(1),'yTick',[0:2:25]);
set(AX(2),'yTick',[0:0.05:1]);