clear
clc
debug = 0;
%% 产生问题矩阵
% 随机矩阵
% m = 500;
% n = 200;



r = 300;
m = 6000;
n = 2*r+1;
% generate nodes
%tj are drawing randomly from a uniform distribution in [0,1]
t = rand(m,1);

%then ordering by magnitude (since they are all positive, just sort)
t = sort(t);
%just to assign the size
w = zeros(m,1); 
x = zeros(n,1);
% generate x 
realx = randn(n,1);
imgx = randn(n,1);
for l = 1:n
   x(l) = realx(l)+1i*imgx(l);
end  
% generate A and b
A = zeros(m,n);
for j = 1:m
%    dealing with special cases when reach the endpoints(nodes)
    if j == 1
        w(j) = (t(2)-t(end)-1)/2;
    elseif j == m
            w(j) = (t(1)+1-t(m-1))/2;
        else
            w(j) = (t(j+1)-t(j-1))/2;
    end              
    for k = -r:r
       A(j,k+r+1) =sqrt(w(j))*exp(2*pi*1i*k*t(j));
    end
end  

A=real(A);
% m=6000;
% n=600;
% A=2*rand(m,n)-1;
   b = 2 * rand(m , 1)-1;

x0 = zeros(n , 1);

tol=1e-2;

fprintf('%s & %d & %d \n','矩阵维数', m, n);
%% 基于IFM的算法找到一个解
maxit_LSQR = 3;
r = b - A * x0;
r(r<0) = 0;
norm_r0 = norm(r);
norm_g0 = norm(A'*r);
fprintf('%s & %g & %g \n','最开始的目标函数和梯度', norm_r0, norm_g0);
% [x_exact, ~, ~, ~, ~] = IFM(A, b, x0,10, maxit_LSQR , 1e-10,[],debug);
% r = b - A * x_exact;
% r(r<0) = 0;
% norm_rexact = norm(r);
% norm_gexact = norm(A'*r);
% fprintf('%s & %g & %g \n','IFM解的目标函数值和梯度  ', norm_rexact, norm_gexact);
 x_exact=[];
%% 参数的设定
 maxit_IFM = 5000;
t=clock;

[x_IFM,iter_IFM,error_IFM,xA_IFM,index_IFM] = IFM(A, b, x0, maxit_IFM, maxit_LSQR ,tol, x_exact,debug);
tf_IFM=etime(clock,t);
r = b - A * x_IFM;
r(r<0) = 0;
r_IFM = norm(r);
g_IFM = norm(A'*r);
fprintf('& %s & %g & %g & %d & %g \\\\\n','IFM', r_IFM, g_IFM,iter_IFM,tf_IFM);

%% GuassSeidel
maxit_Rand =1000000;
t=clock;
 [x_GS,iter_GS,error_GS,xA_GS,index_GS] = GuassSeidelNE(A, b, x0,2.0,maxit_Rand,tol,x_exact,debug);
tf_GS=etime(clock,t);
r = b - A * x_GS;
r(r<0) = 0;
r_GS = norm(r);
g_GS = norm(A'*r);
fprintf('& %s & %g & %g & %d & %g \\\\\n', 'CCD', r_GS, g_GS, iter_GS, tf_GS);


%% simpleGuassSeidel
% maxit_Rand =1000000;
t=clock;
[x_GS,iter_GS,error_SGS,xA_GS,index_GS] = simpleGuassSeidelNE(A, b, x0,2.0,maxit_Rand,tol/2,x_exact,debug);
tf_GS=etime(clock,t);
r = b - A * x_GS;
r(r<0) = 0;
r_GS = norm(r);
g_GS = norm(A'*r);
fprintf('& %s & %g & %g & %d & %g \\\\\n', 'UCD', r_GS, g_GS, iter_GS, tf_GS);

%% randGuassSeidel
% maxit_Rand =630000;
t=clock;
[x_GS,iter_GS,error_RGS,xA_GS,index_GS] = randGuassSeidelNE(A, b, x0,2.0,maxit_Rand,tol,x_exact,debug);
tf_GS=etime(clock,t);
r = b - A * x_GS;
r(r<0) = 0;
r_GS = norm(r);
g_GS = norm(A'*r);
fprintf('& %s & %g & %g & %d & %g \\\\\n', 'RCD', r_GS, g_GS, iter_GS, tf_GS);








%% FM
% maxit =100;

% alpha=1;
% maxit_gs=n;
% t=clock;
% [x_FM,iter_FM,error_k,iter_dFM,index_k] = DFM(A, b, x0, maxit_IFM,alpha,maxit_gs,tol/50, x_exact,debug);
% tf_FM=etime(clock,t);
% r = b - A * x_FM;
% r(r<0) = 0;
% r_FM = norm(r);
% g_FM = norm(A'*r);
% fprintf('& %s & %g & %g & %d & %g \\\\\n','FM', r_FM, g_FM,iter_FM,tf_FM);

%% RFM
% maxit =18;
% tol=[];
% alpha=1;
% maxit_R=n;
% t=clock;
% [x_FM,iter_FM,error_k,iter_dFM,index_k] = RFM(A, b, x0, maxit,alpha,maxit_R, tol, x_exact,debug);
% tf_FM=etime(clock,t);
% r = b - A * x_FM;
% r(r<0) = 0;
% r_FM = norm(r);
% g_FM = norm(A'*r);
% fprintf('& %s & %g & %g & %d & %g \\\\\n','RFM', r_FM, g_FM,iter_FM,tf_FM);


% %% han
% maxIter = 5;
% t=clock;
% [x_GS,rkh,countFMh,countNWh,beginNWh,tfh,vkh,rkArrh]=han(x0,A,b,maxIter);
% tf_GS=etime(clock,t);
% r = b - A * x_GS;
% r(r<0) = 0;
% r_GS = norm(r);
% g_GS = norm(A'*r);
% fprintf('& %s & %g & %g & %d & %g \\\\\n', 'han', r_GS, g_GS, countFMh, tf_GS);


% semilogy(error_GS, 'r') % Matrix A
% xlabel('Iterations') 
% ylabel('Error') 
% hold on 
% semilogy(error_SGS, 'k') % Matrix M
% semilogy(error_RGS, 'g') % Matrix M
% semilogy(error_IFM, 'b') % Matrix M
% legend('CCD', 'UCD', 'RCD','IFM' )

%%%%%%%%%%%%
% 矩阵维数 & 8000 & 1401 
% 最开始的目标函数和梯度 & 36.9619 & 28.2101 
% IFM解的目标函数值和梯度   & 7.83054 & 1.8207 
% & GuassSeidel & 6.85029 & 2.84068 & 43431 & 4.646 \\
% & simpleGuassSeidel & 4.65163 & 0.883448 & 29421 & 3.216 \\
% & randGuassSeidel & 4.64761 & 0.883935 & 25218 & 2.868 \\
% & IFM & 4.02986 & 0.623185 & 29 & 5.687 \\
% & FM & 9.11728 & 4.12671 & 33 & 4.011 \\

%%%%%%%%%%%
% 矩阵维数 & 8000 & 5000 
% 最开始的目标函数和梯度 & 36.7672 & 1502.49 
% & IFM & 9.73235e-07 & 9.15091e-06 & 422 & 76.021 \\
% & CCD & 9.85611e-07 & 8.23254e-06 & 1405000 & 39.619 \\
% & UCD & 9.89213e-07 & 8.46126e-06 & 2265000 & 68.175 \\
% & RCD & 9.97063e-07 & 8.54955e-06 & 2235000 & 93.787 \\

%%%%%%%%%
% 矩阵维数 & 7000 & 5000 
% 最开始的目标函数和梯度 & 33.9312 & 1372.63 
% & IFM & 9.89736e-07 & 1.31695e-05 & 183 & 30.229 \\
% & CCD & 9.14101e-07 & 1.01399e-05 & 725000 & 19.681 \\
% & UCD & 9.37602e-07 & 1.07014e-05 & 1075000 & 30.864 \\
% & RCD & 9.87354e-07 & 1.13674e-05 & 1065000 & 42.464 \\

%%%%%%%%%%%%
% 矩阵维数 & 8000 & 6000 
% 最开始的目标函数和梯度 & 35.6655 & 1576.08 
% & IFM & 9.60808e-07 & 1.54778e-05 & 141 & 31.869 \\
% & CCD & 9.47603e-07 & 1.28784e-05 & 672000 & 19.171 \\
% & UCD & 9.43271e-07 & 1.31044e-05 & 1002000 & 29.871 \\
% & RCD & 9.52272e-07 & 1.33195e-05 & 990000 & 42.817 \\

%%%%%%%%%
% 矩阵维数 & 10000 & 8000 
% 最开始的目标函数和梯度 & 41.131 & 2145.7 
% & IFM & 8.9914e-07 & 1.94051e-05 & 102 & 39.228 \\
% & CCD & 8.77339e-07 & 1.53744e-05 & 680000 & 24.703 \\
% & UCD & 9.1509e-07 & 1.65742e-05 & 992000 & 36.899 \\
% & RCD & 9.82543e-07 & 1.76539e-05 & 976000 & 52.616 \\

%%%%%%%%%%%%%%%
% 矩阵维数 & 12000 & 10000 
% 最开始的目标函数和梯度 & 44.4022 & 2571.47 
% & IFM & 8.64566e-07 & 2.292e-05 & 80 & 42.375 \\
% & CCD & 8.99573e-07 & 1.90147e-05 & 700000 & 28.546 \\
% & UCD & 8.48983e-07 & 1.84887e-05 & 990000 & 40.633 \\
% & RCD & 9.45428e-07 & 2.04913e-05 & 980000 & 60.583 \\

% %%%%%%%%%%%%%%%%%%
% 矩阵维数 & 15000 & 12000 
% 最开始的目标函数和梯度 & 50.3221 & 3179.66 
% & IFM & 9.51309e-07 & 2.55215e-05 & 99 & 80.311 \\
% & CCD & 8.7263e-07 & 1.86892e-05 & 1020000 & 45.149 \\
% & UCD & 9.95146e-07 & 2.20648e-05 & 1476000 & 66.916 \\
% & RCD & 9.86487e-07 & 2.20453e-05 & 1440000 & 100.824 \\

%%%%%%%
% 矩阵维数 & 6000 & 600 
% 最开始的目标函数和梯度 & 31.9484 & 449.691 
% & IFM & 28.6202 & 0.00182823 & 40 & 0.587 \\
% & CCD & 28.6202 & 0.000601892 & 8400 & 0.223 \\
% & UCD & 28.6202 & 0.00231571 & 19800 & 0.514 \\
% & RCD & 28.6202 & 0.00134259 & 19800 & 0.55 \\

%%%%%%%%%%%%%%
% 矩阵维数 & 10000 & 2000 
% 最开始的目标函数和梯度 & 40.9439 & 1052.16 
% & IFM & 31.6294 & 0.00295254 & 82 & 7.476 \\
% & CCD & 31.6294 & 0.00166258 & 64000 & 2.348 \\
% & UCD & 31.6294 & 0.00262359 & 136000 & 5.141 \\
% & RCD & 31.6294 & 0.00282412 & 136000 & 5.72 \\

% %%%%%%%%%%%%%
% 矩阵维数 & 15000 & 3000 
% 最开始的目标函数和梯度 & 49.857 & 1570.4 
% & IFM & 38.5489 & 0.00367496 & 86 & 17.019 \\
% & CCD & 38.5489 & 0.00209706 & 102000 & 4.533 \\
% & UCD & 38.5489 & 0.00365486 & 213000 & 9.704 \\
% & RCD & 38.5489 & 0.00388836 & 216000 & 11.137 \\

%%%%%%%%%%%%%%%%
% 矩阵维数 & 20000 & 4000 
% 最开始的目标函数和梯度 & 57.7701 & 2100.37 
% & IFM & 44.9489 & 0.00462223 & 86 & 30.771 \\
% & CCD & 44.9489 & 0.00238819 & 136000 & 7.338 \\
% & UCD & 44.9489 & 0.00485191 & 284000 & 15.694 \\
% & RCD & 44.9489 & 0.00508076 & 280000 & 18.198 \\

%%%%%%%%
% 矩阵维数 & 30000 & 5000 
% 最开始的目标函数和梯度 & 70.5502 & 2888.51 
% & IFM & 57.6083 & 0.00672003 & 67 & 45.666 \\
% & CCD & 57.6083 & 0.00290263 & 130000 & 8.775 \\
% & UCD & 57.6083 & 0.00626242 & 280000 & 19.295 \\
% & RCD & 57.6083 & 0.00609042 & 275000 & 22.521 \\

% %%%%%%%%%%%%%%%%
% 矩阵维数 & 40000 & 6000 
% 最开始的目标函数和梯度 & 81.6042 & 3647 
% & IFM & 68.223 & 0.00833488 & 61 & 65.651 \\
% & CCD & 68.223 & 0.00294496 & 138000 & 11.589 \\
% & UCD & 68.223 & 0.00801527 & 300000 & 24.827 \\
% & RCD & 68.223 & 0.00779252 & 294000 & 28.046 \\

% 矩阵维数 & 6000 & 601 
% 最开始的目标函数和梯度 & 31.9219 & 19.1749 
% & IFM & 0.759325 & 0.0275302 & 606 & 7.816 \\
% & CCD & 1.30584 & 0.0700874 & 66110 & 1.551 \\
% & UCD & 1.14373 & 0.0542146 & 68514 & 2.8 \\
% & RCD & 1.60922 & 0.0903438 & 31853 & 1.35 \\
%矩阵维数 & 10000 & 1001 
%最开始的目标函数和梯度 & 41.0165 & 24.9397 
%& IFM & 0.882377 & 0.0296899 & 928 & 39.024 \\
%& CCD & 0.43119 & 0.0134421 & 500000 & 17.671 \\
%& UCD & 0.45638 & 0.0145409 & 500000 & 18.324 \\
%& RCD & 0.348757 & 0.0101935 & 471471 & 18.417 \\
%矩阵维数 & 10000 & 1001 
%最开始的目标函数和梯度 & 40.8849 & 25.6149 
%& IFM & 0.801303 & 0.0282923 & 784 & 33.012 \\
%& CCD & 1.57176 & 0.077961 & 145145 & 5.167 \\
%& UCD & 1.67711 & 0.094864 & 100100 & 3.723 \\
%& RCD & 1.88807 & 0.0959638 & 92092 & 3.624 \\

% 矩阵维数 & 15000 & 1401 
% 最开始的目标函数和梯度 & 49.9901 & 30.1291 
% & IFM & 1.17906 & 0.0343464 & 791 & 72.01 \\
% & CCD & 1.83924 & 0.0815199 & 203145 & 8.893 \\
% & UCD & 1.82115 & 0.098667 & 102273 & 4.683 \\
% & RCD & 1.93159 & 0.0816353 & 124689 & 6.022 \\


%矩阵维数 & 15000 & 1401 
%最开始的目标函数和梯度 & 50.1787 & 30.2459 
%& IFM & 1.17906 & 0.0343464 & 791 & 72.01 \\
%& CCD & 1.49189 & 0.0731322 & 226962 & 9.85 \\
%& UCD & 1.42348 & 0.0682399 & 232566 & 10.439 \\
%& RCD & 1.40355 & 0.0798074 & 134496 & 6.506 \\


%矩阵维数 & 20000 & 2001 
%最开始的目标函数和梯度 & 57.7179 & 35.2397 
%& IFM & 1.73643 & 0.0320933 & 858 & 102.278 \\
%& CCD & 1.75808 & 0.0791593 & 310155 & 16.364 \\
%& UCD & 1.75726 & 0.0815633 & 318159 & 17.517 \\
%& RCD & 1.9705 & 0.0876539 & 190095 & 11.986 \\

% 矩阵维数 & 30000 & 3001 
% 最开始的目标函数和梯度 & 70.7815 & 43.3598 
% & IFM & 3.86766 & 0.196176 & 236 & 95.478 \\
% & CCD & 2.56817 & 0.106336 & 500000 & 33.194 \\
% & UCD & 2.72826 & 0.121396 & 500000 & 34.137 \\
% & RCD & 2.78458 & 0.114458 & 375125 & 27.759 \\
%矩阵维数 & 30000 & 3001 
%最开始的目标函数和梯度 & 71.217 & 43.2723 
%& IFM & 3.5851 & 0.188752 & 231 & 91.332 \\
%& CCD & 2.14484 & 0.0857835 & 525175 & 34.651 \\
%& UCD & 1.88078 & 0.0711648 & 609203 & 41.185 \\
%& RCD & 2.10542 & 0.0891129 & 348116 & 25.65 \\
% 矩阵维数 & 40000 & 4001 
% 最开始的目标函数和梯度 & 81.668 & 49.7005 
% & IFM & 3.8058 & 0.194414 & 266 & 187.578 \\
% & CCD & 2.0919 & 0.0840152 & 800200 & 62.27 \\
% & UCD & 1.75781 & 0.0649116 & 964241 & 77.487 \\
% & RCD & 2.13998 & 0.0799911 & 572143 & 51.662 \\